LeslieGomez-MojoBoot/HW-10/animal_app/app/controllers/animals_controller.rb

INSERT INTO "animals" ("name", "animal_type", "age", "available", "blood_type", "size", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @animal = Animal.new(animal_params)

    respond_to do |format|
      if @animal.save

UPDATE "animals" SET "size" = ?, "updated_at" = ? WHERE "animals"."id" = ?  [["size", "X-Large"], ["updated_at", "2015-09-03 00:19:10.621069"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @animal.update(animal_params)